{
  "cells": [
    {
      "attachments": {},
      "cell_type": "markdown",
      "id": "2-4F3kLK4HjU",
      "metadata": {
        "id": "2-4F3kLK4HjU"
      },
      "source": [
        "# Catastrophe"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 151,
      "id": "2a159217",
      "metadata": {},
      "outputs": [],
      "source": [
        "import warnings\n",
        "warnings.filterwarnings('ignore')"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 316,
      "id": "77ef7742",
      "metadata": {},
      "outputs": [],
      "source": [
        "# Define Neo4j connections\n",
        "import pandas as pd\n",
        "import random\n",
        "from neo4j import GraphDatabase\n",
        "host = 'bolt://localhost:7687'\n",
        "user = 'neo4j'\n",
        "password = 'password'\n",
        "driver = GraphDatabase.driver(host,auth=(user, password))\n",
        "\n",
        "# Configuration de l'option d'affichage\n",
        "pd.set_option('display.max_rows', None)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 317,
      "id": "1567c716",
      "metadata": {},
      "outputs": [],
      "source": [
        "def run_query(query):\n",
        "    with driver.session() as session:\n",
        "        result = session.run(query)\n",
        "        return pd.DataFrame([r.values() for r in result], columns=result.keys())"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 318,
      "id": "4286357d",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "Empty DataFrame\n",
              "Columns: []\n",
              "Index: []"
            ]
          },
          "execution_count": 318,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "delete_node = \"\"\"\n",
        "    MATCH (n)\n",
        "    WHERE NOT labels(n) = ['_GraphConfig']\n",
        "    DETACH DELETE n\n",
        "\"\"\"\n",
        "run_query(delete_node)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 319,
      "id": "502dc3a9",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>param</th>\n",
              "      <th>value</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>handleVocabUris</td>\n",
              "      <td>IGNORE</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>1</th>\n",
              "      <td>handleMultival</td>\n",
              "      <td>OVERWRITE</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>2</th>\n",
              "      <td>handleRDFTypes</td>\n",
              "      <td>LABELS</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>3</th>\n",
              "      <td>keepLangTag</td>\n",
              "      <td>False</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>4</th>\n",
              "      <td>keepCustomDataTypes</td>\n",
              "      <td>False</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>5</th>\n",
              "      <td>applyNeo4jNaming</td>\n",
              "      <td>False</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>6</th>\n",
              "      <td>baseSchemaNamespace</td>\n",
              "      <td>neo4j://graph.schema#</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>7</th>\n",
              "      <td>baseSchemaPrefix</td>\n",
              "      <td>n4sch</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>8</th>\n",
              "      <td>classLabel</td>\n",
              "      <td>Class</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>9</th>\n",
              "      <td>subClassOfRel</td>\n",
              "      <td>SCO</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>10</th>\n",
              "      <td>dataTypePropertyLabel</td>\n",
              "      <td>Property</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>11</th>\n",
              "      <td>objectPropertyLabel</td>\n",
              "      <td>Relationship</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>12</th>\n",
              "      <td>subPropertyOfRel</td>\n",
              "      <td>SPO</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>13</th>\n",
              "      <td>domainRel</td>\n",
              "      <td>DOMAIN</td>\n",
              "    </tr>\n",
              "    <tr>\n",
              "      <th>14</th>\n",
              "      <td>rangeRel</td>\n",
              "      <td>RANGE</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "                    param                  value\n",
              "0         handleVocabUris                 IGNORE\n",
              "1          handleMultival              OVERWRITE\n",
              "2          handleRDFTypes                 LABELS\n",
              "3             keepLangTag                  False\n",
              "4     keepCustomDataTypes                  False\n",
              "5        applyNeo4jNaming                  False\n",
              "6     baseSchemaNamespace  neo4j://graph.schema#\n",
              "7        baseSchemaPrefix                  n4sch\n",
              "8              classLabel                  Class\n",
              "9           subClassOfRel                    SCO\n",
              "10  dataTypePropertyLabel               Property\n",
              "11    objectPropertyLabel           Relationship\n",
              "12       subPropertyOfRel                    SPO\n",
              "13              domainRel                 DOMAIN\n",
              "14               rangeRel                  RANGE"
            ]
          },
          "execution_count": 319,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "deleConfig = \"\"\"\n",
        "CALL n10s.graphconfig.drop\n",
        "\"\"\"\n",
        "run_query(deleConfig)\n",
        "\n",
        "n10s_config_query = \"\"\"\n",
        "CALL n10s.graphconfig.init({ handleVocabUris: \"IGNORE\", keepLangTag: false, handleMultival: \"OVERWRITE\"});\n",
        "\"\"\"\n",
        "run_query(n10s_config_query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 320,
      "id": "c7bfddc6",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "Empty DataFrame\n",
              "Columns: []\n",
              "Index: []"
            ]
          },
          "execution_count": 320,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "n10s_config_query = \"\"\"\n",
        "CREATE CONSTRAINT  n10s_unique_uri IF NOT EXISTS FOR (r:Resource) REQUIRE r.uri IS UNIQUE;\n",
        "\"\"\"\n",
        "run_query(n10s_config_query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 321,
      "id": "774946c6",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>terminationStatus</th>\n",
              "      <th>triplesLoaded</th>\n",
              "      <th>triplesParsed</th>\n",
              "      <th>namespaces</th>\n",
              "      <th>extraInfo</th>\n",
              "      <th>callParams</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>OK</td>\n",
              "      <td>229</td>\n",
              "      <td>231</td>\n",
              "      <td>None</td>\n",
              "      <td></td>\n",
              "      <td>{'singleTx': False}</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "  terminationStatus  triplesLoaded  triplesParsed namespaces extraInfo  \\\n",
              "0                OK            229            231       None             \n",
              "\n",
              "            callParams  \n",
              "0  {'singleTx': False}  "
            ]
          },
          "execution_count": 321,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "import_ontology = \"\"\"\n",
        "    CALL n10s.onto.import.fetch(\"https://raw.githubusercontent.com/mouridoullah/elk-knowledge-graph/main/rdfData/file5.ttl\", \"Turtle\") \n",
        "\"\"\"\n",
        "\n",
        "\n",
        "run_query(import_ontology)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 322,
      "id": "b9e7e8a2",
      "metadata": {},
      "outputs": [],
      "source": [
        "rsecouriste = \"\"\"\n",
        "CALL n10s.rdf.import.fetch(\"https://raw.githubusercontent.com/mouridoullah/elk-knowledge-graph/main/rdfData/file6.ttl\",\"Turtle\");\n",
        "\"\"\"\n",
        "run_query(rsecouriste)\n",
        "labels = [\"Médecin\", \"Militaire\", \"Infirmier\", \"Pompiers\"]\n",
        "for label in labels:\n",
        "    query = f\"MATCH (c:Resource {{name: '{label}'}}), (d:{label}) MERGE (d)-[:instanceOf]->(c)\"\n",
        "    run_query(query)"
      ]
    },
    {
      "attachments": {},
      "cell_type": "markdown",
      "id": "63c352c7",
      "metadata": {},
      "source": [
        "| Catastrophe  | QCode         | \n",
        "| :--------------- |:---------------:| \n",
        "|Séisme | Q7944 |\n",
        "|Inondation | Q76337338|\n",
        "|IncendieDeForet | Q169950|\n",
        "|Tempete | Q81054|\n",
        "|Secheresse | Q43059|\n",
        "|GlissementDeTerrain | Q167903 |\n",
        "|Tsunami | Q8070|\n",
        "|cyclone | Q79602|\n",
        "|AccidentDeTrain | Q1078765|\n",
        "|IncendieDeMaison | Q7625093|\n",
        "|Explosion | Q179057|\n",
        "|AccidentNucleaire | Q1620824|\n",
        "\n",
        "   "
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 323,
      "id": "14804f03",
      "metadata": {},
      "outputs": [],
      "source": [
        "disasters = {\n",
        "    \"Seisme\": \"Q7944\",\n",
        "    \"Inondation\": \"Q8068\",\n",
        "    \"IncendieDeForet\": \"Q169950\",\n",
        "    \"Tempete\": \"Q81054\",\n",
        "    \"Secheresse\": \"Q43059\",\n",
        "    \"Tsunami\": \"Q8070\",\n",
        "    \"AccidentDeTrain\": \"Q1078765\",\n",
        "    \"IncendieDeMaison\": \"Q7625093\",\n",
        "    \"Explosion\": \"Q179057\"\n",
        "    # \"AccidentNucleaire\": \"Q1620824\",\n",
        "    # \"GlissementDeTerrain\": \"Q167903\",\n",
        "    # \"Cyclone\": \"Q79602\",\n",
        "}"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 313,
      "id": "f9b43acf",
      "metadata": {},
      "outputs": [],
      "source": [
        "def get_random_disaster():\n",
        "    liste_de_tuples = list(disasters.items())\n",
        "    tuple_aléatoire = random.choice(liste_de_tuples)\n",
        "    clé_aléatoire = tuple_aléatoire[0]\n",
        "    valeur_aléatoire = tuple_aléatoire[1]\n",
        "    return clé_aléatoire, valeur_aléatoire"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 314,
      "id": "739001ab",
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "  terminationStatus  triplesLoaded\n",
            "0                OK             14 IncendieDeForet\n"
          ]
        }
      ],
      "source": [
        "clé_aléatoire, valeur_aléatoire = get_random_disaster()\n",
        "\n",
        "query = f'''\n",
        "WITH \n",
        "'\n",
        "CONSTRUCT {{\n",
        "  ?event a schema:{clé_aléatoire}, schema:Event ;\n",
        "          schema:name ?eventLabel ;\n",
        "          schema:description ?description ;\n",
        "          schema:startDate ?date ;\n",
        "          schema:aLieu ?location ;\n",
        "          schema:numberOfInjured ?numberOfInjured ;\n",
        "          schema:numberOfDeaths ?numberOfDeaths ;\n",
        "          schema:aLieu ?locatedIn .\n",
        "  ?location rdfs:label ?locationLabel ; a schema:Country, schema:SpatialThing.\n",
        "  ?locatedIn rdfs:label ?locatedInLabel ; a schema:City, schema:SpatialThing.\n",
        "}} WHERE {{\n",
        "  ?event wdt:P31/wdt:P279* wd:{valeur_aléatoire} ;\n",
        "          wdt:P17 ?location ;\n",
        "          wdt:P585 ?date .\n",
        "  OPTIONAL {{ ?event wdt:P2320 ?aftershocks . }}\n",
        "  OPTIONAL {{ ?event wdt:P18 ?image . }}\n",
        "  OPTIONAL {{ ?event wdt:P10 ?video . }}\n",
        "  OPTIONAL {{ ?event wdt:P2528 ?magnitude . }}\n",
        "  OPTIONAL {{ ?event wdt:P1339 ?numberOfInjured . }}\n",
        "  OPTIONAL {{ ?event wdt:P1120 ?numberOfDeaths . }}\n",
        "  OPTIONAL {{ ?event wdt:P131 ?locatedIn . ?locatedIn rdfs:label ?locatedInLabel . FILTER(LANG(?locatedInLabel) = \"fr\") }}\n",
        "  OPTIONAL {{ ?event schema:description ?description . FILTER(LANG(?description) = \"fr\") }}\n",
        "  ?location rdfs:label ?locationLabel . FILTER(LANG(?locationLabel) = \"fr\")\n",
        "  ?event rdfs:label ?eventLabel . FILTER(LANG(?eventLabel) = \"fr\")\n",
        "  SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }}\n",
        "}} ORDER BY RAND()\n",
        "LIMIT 1\n",
        "' AS sparql\n",
        "CALL n10s.rdf.import.fetch(\n",
        "  \"https://query.wikidata.org/sparql?query=\" + \n",
        "    apoc.text.urlencode(sparql),\"JSON-LD\", \n",
        "  {{ headerParams: {{ Accept: \"application/ld+json\"}} , \n",
        "    handleVocabUris: \"IGNORE\"}}) \n",
        "YIELD terminationStatus, triplesLoaded \n",
        "RETURN terminationStatus, triplesLoaded\n",
        "'''\n",
        "\n",
        "print(run_query(query), clé_aléatoire)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 315,
      "id": "be62e872",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>n</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "Empty DataFrame\n",
              "Columns: [n]\n",
              "Index: []"
            ]
          },
          "execution_count": 315,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "unwind = \"\"\"\n",
        "MATCH (n:Event)\n",
        "WHERE n.uri IS NOT NULL\n",
        "UNWIND n.startDate AS startDate\n",
        "MERGE (n)-[:aPourDate]->(:Date { value: startDate })\n",
        "\n",
        "WITH n\n",
        "UNWIND n.numberOfInjured AS numberOfInjured\n",
        "MERGE (n)-[:Implique]->(:Blesses { value: numberOfInjured })\n",
        "\n",
        "WITH n\n",
        "UNWIND n.numberOfDeaths AS numberOfDeaths\n",
        "MERGE (n)-[:Implique]->(:Morts { value: numberOfDeaths })\n",
        "\n",
        "WITH n\n",
        "MATCH (n:Infirmier)\n",
        "WHERE n.uri IS NOT NULL\n",
        "UNWIND n.NombreDInfirmiers AS NombreDInfirmiers\n",
        "MERGE (n)-[:related]->(:Int { value: NombreDInfirmiers })\n",
        "\n",
        "RETURN n\n",
        "\"\"\"\n",
        "run_query(unwind)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 311,
      "id": "254b9ef6",
      "metadata": {},
      "outputs": [],
      "source": [
        "labels = [\"Seisme\", \"Inondation\", \"IncendieDeForet\", \"Tempete\", \"Secheresse\", \"GlissementDeTerrain\", \"Tsunami\", \"Cyclone\", \"Date\", \"SpatialThing\", \n",
        "          \"AccidentDeTrain\", \"IncendieDeMaison\", \"Explosion\", \"AccidentNucleaire\", \"Morts\", \"Blesses\"]\n",
        "\n",
        "\n",
        "for label in labels:\n",
        "    query = f\"MATCH (c:Resource {{name: '{label}'}}), (d:{label}) MERGE (d)-[:instanceOf]->(c)\"\n",
        "    run_query(query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 264,
      "id": "6bab7d9f",
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "  terminationStatus  triplesLoaded\n",
            "0                OK             64 Explosion\n"
          ]
        }
      ],
      "source": [
        "# clé_aléatoire, valeur_aléatoire = get_random_disaster()\n",
        "\n",
        "# query = f'''\n",
        "# WITH \n",
        "# '\n",
        "# CONSTRUCT {{\n",
        "#   ?event a schema:{clé_aléatoire}, schema:Event ;\n",
        "#           schema:name ?eventLabel ;\n",
        "#           schema:description ?description ;\n",
        "#           schema:startDate ?date ;\n",
        "#           schema:aLieu ?location ;\n",
        "#           schema:numberOfInjured ?numberOfInjured ;\n",
        "#           schema:numberOfDeaths ?numberOfDeaths ;\n",
        "#           schema:aLieu ?locatedIn .\n",
        "#   ?location rdfs:label ?locationLabel ; a schema:Country, schema:SpatialThing.\n",
        "#   ?locatedIn rdfs:label ?locatedInLabel ; a schema:City, schema:SpatialThing.\n",
        "# }} WHERE {{\n",
        "#   ?event wdt:P31/wdt:P279* wd:{valeur_aléatoire} ;\n",
        "#           wdt:P17 ?location ;\n",
        "#           wdt:P585 ?date .\n",
        "#   OPTIONAL {{ ?event wdt:P2320 ?aftershocks . }}\n",
        "#   OPTIONAL {{ ?event wdt:P18 ?image . }}\n",
        "#   OPTIONAL {{ ?event wdt:P10 ?video . }}\n",
        "#   OPTIONAL {{ ?event wdt:P2528 ?magnitude . }}\n",
        "#   OPTIONAL {{ ?event wdt:P1339 ?numberOfInjured . }}\n",
        "#   OPTIONAL {{ ?event wdt:P1120 ?numberOfDeaths . }}\n",
        "#   OPTIONAL {{ ?event wdt:P131 ?locatedIn . ?locatedIn rdfs:label ?locatedInLabel . FILTER(LANG(?locatedInLabel) = \"fr\") }}\n",
        "#   OPTIONAL {{ ?event schema:description ?description . FILTER(LANG(?description) = \"fr\") }}\n",
        "#   ?location rdfs:label ?locationLabel . FILTER(LANG(?locationLabel) = \"fr\")\n",
        "#   ?event rdfs:label ?eventLabel . FILTER(LANG(?eventLabel) = \"fr\")\n",
        "#   SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }}\n",
        "# }} LIMIT 5\n",
        "# ' AS sparql\n",
        "# CALL n10s.rdf.import.fetch(\n",
        "#   \"https://query.wikidata.org/sparql?query=\" + \n",
        "#     apoc.text.urlencode(sparql),\"JSON-LD\", \n",
        "#   {{ headerParams: {{ Accept: \"application/ld+json\"}} , \n",
        "#     handleVocabUris: \"IGNORE\"}}) \n",
        "# YIELD terminationStatus, triplesLoaded \n",
        "# RETURN terminationStatus, triplesLoaded\n",
        "# '''\n",
        "\n",
        "# print(run_query(query), clé_aléatoire)\n",
        "\n",
        "\n",
        "# unwind = \"\"\"\n",
        "# MATCH (n:Event)\n",
        "# WHERE n.uri IS NOT NULL\n",
        "# UNWIND n.startDate AS startDate\n",
        "# MERGE (n)-[:aPourDate]->(:Date { value: startDate })\n",
        "\n",
        "# WITH n\n",
        "# UNWIND n.numberOfInjured AS numberOfInjured\n",
        "# MERGE (n)-[:Implique]->(:Blesses { value: numberOfInjured })\n",
        "\n",
        "# WITH n\n",
        "# UNWIND n.numberOfDeaths AS numberOfDeaths\n",
        "# MERGE (n)-[:Implique]->(:Morts { value: numberOfDeaths })\n",
        "\n",
        "# WITH n\n",
        "# MATCH (n:Infirmier)\n",
        "# WHERE n.uri IS NOT NULL\n",
        "# UNWIND n.NombreDInfirmiers AS NombreDInfirmiers\n",
        "# MERGE (n)-[:related]->(:Int { value: NombreDInfirmiers })\n",
        "\n",
        "# RETURN n\n",
        "# \"\"\"\n",
        "# run_query(unwind)\n",
        "\n",
        "# labels = [\"Seisme\", \"Inondation\", \"IncendieDeForet\", \"Tempete\", \"Secheresse\", \"GlissementDeTerrain\", \"Tsunami\", \"Cyclone\", \"Date\", \"SpatialThing\", \n",
        "#           \"AccidentDeTrain\", \"IncendieDeMaison\", \"Explosion\", \"AccidentNucleaire\", \"Morts\", \"Blesses\"]\n",
        "\n",
        "\n",
        "# for label in labels:\n",
        "#     query = f\"MATCH (c:Resource {{name: '{label}'}}), (d:{label}) MERGE (d)-[:instanceOf]->(c)\"\n",
        "#     run_query(query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 251,
      "metadata": {},
      "outputs": [],
      "source": [
        "# disasters = {\n",
        "#     \"Seisme\": \"Q7944\",\n",
        "#     \"Inondation\": \"Q8068\",\n",
        "#     \"IncendieDeForet\": \"Q169950\",\n",
        "#     \"Tempete\": \"Q81054\",\n",
        "#     \"Secheresse\": \"Q43059\",\n",
        "#     \"GlissementDeTerrain\": \"Q167903\",\n",
        "#     \"Tsunami\": \"Q8070\",\n",
        "#     \"cyclone\": \"Q79602\",\n",
        "#     \"AccidentDeTrain\": \"Q1078765\",\n",
        "#     \"IncendieDeMaison\": \"Q7625093\",\n",
        "#     \"Explosion\": \"Q179057\",\n",
        "#     \"AccidentNucleaire\": \"Q1620824\"\n",
        "# }\n",
        "\n",
        "# for disaster, qid in disasters.items():\n",
        "#     query = f'''\n",
        "#     WITH \n",
        "#     '\n",
        "#     CONSTRUCT {{\n",
        "#       ?event a schema:{disaster}, schema:Event ;\n",
        "#              schema:name ?eventLabel ;\n",
        "#              schema:description ?description ;\n",
        "#              schema:startDate ?date ;\n",
        "#              schema:location ?location ;\n",
        "#              schema:image ?image ;\n",
        "#              schema:video ?video ;\n",
        "#              schema:hasSeverity ?magnitude ;\n",
        "#              schema:numberOfInjured ?numberOfInjured ;\n",
        "#              schema:numberOfDeaths ?numberOfDeaths ;\n",
        "#              schema:hasAftershock ?aftershocks ;\n",
        "#              schema:locatedInPlace ?locatedIn .\n",
        "#       ?location rdfs:label ?locationLabel ; a schema:Country.\n",
        "#       ?locatedIn rdfs:label ?locatedInLabel ; a schema:City.\n",
        "#       ?date rdfs:label ?date ; a schema:date .\n",
        "#     }} WHERE {{\n",
        "#       ?event wdt:P31/wdt:P279* wd:{qid} ;\n",
        "#              wdt:P17 ?location ;\n",
        "#              wdt:P585 ?date .\n",
        "#       OPTIONAL {{ ?event wdt:P2320 ?aftershocks . }}\n",
        "#       OPTIONAL {{ ?event wdt:P18 ?image . }}\n",
        "#       OPTIONAL {{ ?event wdt:P10 ?video . }}\n",
        "#       OPTIONAL {{ ?event wdt:P2528 ?magnitude . }}\n",
        "#       OPTIONAL {{ ?event wdt:P1339 ?numberOfInjured . }}\n",
        "#       OPTIONAL {{ ?event wdt:P1120 ?numberOfDeaths . }}\n",
        "#       OPTIONAL {{ ?event wdt:P131 ?locatedIn . ?locatedIn rdfs:label ?locatedInLabel . FILTER(LANG(?locatedInLabel) = \"fr\") }}\n",
        "#       OPTIONAL {{ ?event schema:description ?description . FILTER(LANG(?description) = \"fr\") }}\n",
        "#       ?location rdfs:label ?locationLabel . FILTER(LANG(?locationLabel) = \"fr\")\n",
        "#       ?event rdfs:label ?eventLabel . FILTER(LANG(?eventLabel) = \"fr\")\n",
        "#       SERVICE wikibase:label {{ bd:serviceParam wikibase:language \"[AUTO_LANGUAGE],fr\". }}\n",
        "#     }} \n",
        "#     ' AS sparql\n",
        "#     CALL n10s.rdf.import.fetch(\n",
        "#       \"https://query.wikidata.org/sparql?query=\" + \n",
        "#         apoc.text.urlencode(sparql),\"JSON-LD\", \n",
        "#       {{ headerParams: {{ Accept: \"application/ld+json\"}} , \n",
        "#         handleVocabUris: \"IGNORE\"}}) \n",
        "#     YIELD terminationStatus, triplesLoaded \n",
        "#     RETURN terminationStatus, triplesLoaded\n",
        "#     '''\n",
        "\n",
        "#     print(run_query(query), disaster)\n",
        "    "
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 270,
      "id": "4016d0dc",
      "metadata": {},
      "outputs": [],
      "source": [
        "# # Liste des labels des catastrophes\n",
        "# labels = [\"Seisme\", \"Inondation\", \"IncendieDeForet\", \"Tempete\", \"Secheresse\", \"GlissementDeTerrain\", \"Tsunami\", \"cyclone\", \"AccidentDeTrain\", \"IncendieDeMaison\", \"Explosion\", \"AccidentNucleaire\", \"Pompiers\", \"Médecin\", \"Militaire\", \"Infirmier\"]\n",
        "\n",
        "\n",
        "# for label in labels:\n",
        "#     # Requête Cypher pour créer la relation \"instanceOf\"\n",
        "#     query = f\"MATCH (c:Class {{name: '{label}'}}), (d:{label}) MERGE (d)-[:instanceOf]->(c)\"\n",
        "#     # Exécution de la requête\n",
        "#     run_query(query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 91,
      "id": "364225f6",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>count(*)</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "    <tr>\n",
              "      <th>0</th>\n",
              "      <td>0</td>\n",
              "    </tr>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "   count(*)\n",
              "0         0"
            ]
          },
          "execution_count": 91,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "seism_count_query = \"\"\"\n",
        "    MATCH (n:Seisme)\n",
        "    RETURN count(*)\n",
        "\"\"\"\n",
        "\n",
        "run_query(seism_count_query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 92,
      "id": "45d1b010",
      "metadata": {},
      "outputs": [
        {
          "data": {
            "text/html": [
              "<div>\n",
              "<style scoped>\n",
              "    .dataframe tbody tr th:only-of-type {\n",
              "        vertical-align: middle;\n",
              "    }\n",
              "\n",
              "    .dataframe tbody tr th {\n",
              "        vertical-align: top;\n",
              "    }\n",
              "\n",
              "    .dataframe thead th {\n",
              "        text-align: right;\n",
              "    }\n",
              "</style>\n",
              "<table border=\"1\" class=\"dataframe\">\n",
              "  <thead>\n",
              "    <tr style=\"text-align: right;\">\n",
              "      <th></th>\n",
              "      <th>n.label</th>\n",
              "      <th>related.name</th>\n",
              "      <th>related.description</th>\n",
              "      <th>related.startDate</th>\n",
              "    </tr>\n",
              "  </thead>\n",
              "  <tbody>\n",
              "  </tbody>\n",
              "</table>\n",
              "</div>"
            ],
            "text/plain": [
              "Empty DataFrame\n",
              "Columns: [n.label, related.name, related.description, related.startDate]\n",
              "Index: []"
            ]
          },
          "execution_count": 92,
          "metadata": {},
          "output_type": "execute_result"
        }
      ],
      "source": [
        "disasterTurquie = \"\"\"\n",
        "    MATCH (n:Country)-[]-(related)\n",
        "    WHERE any(label IN n.label WHERE label CONTAINS 'Turquie') OR any(label IN n.label WHERE label CONTAINS 'Syrie')\n",
        "    RETURN n.label, related.name, related.description, related.startDate\n",
        "    ORDER BY related.startDate DESC\n",
        "\"\"\"\n",
        "\n",
        "run_query(disasterTurquie)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "66399455",
      "metadata": {},
      "outputs": [],
      "source": [
        "inferCatastropheNaturelle = \"\"\"\n",
        "  CALL n10s.inference.nodesLabelled('CatastropheNaturelle',  {\n",
        "    catNameProp: \"name\",\n",
        "    catLabel: \"Resource\",\n",
        "    subCatRel: \"SCO\"\n",
        "  })\n",
        "  YIELD node\n",
        "  RETURN labels(node), node.name, node.description\n",
        "  ORDER BY labels(node)\n",
        "\"\"\"\n",
        "\n",
        "run_query(inferCatastropheNaturelle)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "687c6696",
      "metadata": {},
      "outputs": [],
      "source": [
        "user = \"\"\"\n",
        "    MERGE (jb:User { userId : \"JB2020\"}) with jb\n",
        "    MATCH (e1:Event { uri: \"http://www.wikidata.org/entity/Q192050\" })\n",
        "    MATCH (e2:Event { uri: \"http://www.wikidata.org/entity/Q1808853\" })\n",
        "    WITH jb, e1, e2\n",
        "    MERGE (e1)<-[:INTERESTED_IN]-(jb)-[:INTERESTED_IN]->(e2)\n",
        "\"\"\"\n",
        "\n",
        "run_query(user)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "36de7749",
      "metadata": {},
      "outputs": [],
      "source": [
        "query = \"\"\"\n",
        "    MATCH (:User { userId : \"JB2020\"})-[:INTERESTED_IN]->(b:Event)\n",
        "    WHERE n10s.inference.hasLabel(b,'Catastrophe',({ catNameProp: \"name\", catLabel: \"Resource\", subCatRel: \"SCO\" }))\n",
        "    RETURN b.uri as uri, b.name as name, labels(b) as categories;\n",
        "\"\"\"\n",
        "\n",
        "run_query(query)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "0d0f9b7a",
      "metadata": {},
      "outputs": [],
      "source": [
        "infer = \"\"\"\n",
        "    MATCH (cat:Resource { name: \"CatastropheTechnologique\"})\n",
        "    CALL n10s.inference.nodesInCategory(cat, { inCatRel: \"instanceOf\", subCatRel: \"SCO\"}) yield node\n",
        "    RETURN labels(node), node.name, node.description\n",
        "    ORDER BY labels(node)\n",
        "\"\"\"\n",
        "\n",
        "run_query(infer)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "99f81dfe",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "be5f1833",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "4f8f0c92",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "738ebc74",
      "metadata": {},
      "outputs": [],
      "source": [
        "delete_node = \"\"\"\n",
        "    MATCH (n)\n",
        "    WHERE NOT labels(n) = ['_GraphConfig']\n",
        "    DETACH DELETE n\n",
        "\"\"\"\n",
        "run_query(delete_node)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "727031a7",
      "metadata": {},
      "outputs": [],
      "source": [
        "data = \"\"\"\n",
        "CALL n10s.onto.import.fetch(\"https://github.com/neo4j-labs/neosemantics/raw/3.5/docs/rdf/movieDBRelHierarchy.ttl\", \"Turtle\");\n",
        "\"\"\"\n",
        "run_query(data)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "8514d1f1",
      "metadata": {},
      "outputs": [],
      "source": [
        "infer = \"\"\"\n",
        "    match (thematrix:Movie {title: \"The Matrix\"})\n",
        "    call n10s.inference.getRels(thematrix,\"WORKED_IN\", { subRelRel: \"SPO\" }) yield rel, node\n",
        "    return type(rel) as relType, node.name, node.born\n",
        "\"\"\"\n",
        "\n",
        "run_query(infer)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "a53897cf",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "4e2aa3f3",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "3450db82",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "9d083617",
      "metadata": {},
      "outputs": [],
      "source": []
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "f6cff7ba",
      "metadata": {},
      "outputs": [],
      "source": [
        "# unwind = \"\"\"\n",
        "# MATCH (n:Resource)\n",
        "# WHERE n.name IS NOT NULL\n",
        "# WITH n\n",
        "# UNWIND n.hasSeverity AS severity\n",
        "# CREATE (n)-[:HAS_SEVERITY]->(:Severity {value: severity})\n",
        "# WITH n\n",
        "# UNWIND n.startDate AS date\n",
        "# CREATE (n)-[:START_DATE]->(:StartDate {value: date})\n",
        "# WITH n\n",
        "# UNWIND n.numberOfInjured AS injured\n",
        "# CREATE (n)-[:NUMBER_OF_INJURED]->(:NumberOfInjured {value: injured})\n",
        "# WITH n\n",
        "# UNWIND n.numberOfDeaths AS deaths\n",
        "# CREATE (n)-[:NUMBER_OF_DEATHS]->(:NumberOfDeaths {value: deaths})\n",
        "# WITH n\n",
        "# UNWIND n.hasAftershock AS aftershock\n",
        "# CREATE (n)-[:HAS_AFTERSHOCK]->(:Aftershock {value: aftershock})\n",
        "\n",
        "# RETURN n\n",
        "# \"\"\"\n",
        "# run_query(unwind)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "4e2aa15e",
      "metadata": {},
      "outputs": [],
      "source": [
        "# import_ontology = \"\"\"\n",
        "# CALL n10s.onto.import.fetch(\"https://raw.githubusercontent.com/mouridoullah/elk-knowledge-graph/main/rdfData/cata.ttl\", \"Turtle\") \n",
        "# \"\"\"\n",
        "# run_query(import_ontology)\n",
        "\n",
        "# import_data = \"\"\"\n",
        "# CALL n10s.rdf.import.fetch(\"https://raw.githubusercontent.com/mouridoullah/elk-knowledge-graph/main/rdfData/data.ttl\",\"Turtle\");\n",
        "# \"\"\"\n",
        "\n",
        "# run_query(import_data)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "1c4167c7",
      "metadata": {},
      "outputs": [],
      "source": [
        "# onto = \"\"\" \n",
        "# CREATE (cata:Class { authoritativeLabel: \"Catastrophe\", name: \"Catastrophe\", identifier: \"sh 8503449854\" })\n",
        "# CREATE (c:Class { authoritativeLabel: \"Catastrophe Naturelle\", name: \"CatastropheNaturelle\", identifier: \"sh 85034498\" })\n",
        "# CREATE (po:Class { authoritativeLabel: \"Explosion\", name: \"Explosion\", identifier: \"sh 85095187\" })\n",
        "# CREATE (s:Class { authoritativeLabel: \"Incendie De Foret\", name: \"IncendieDeForet\", identifier: \"sh 85124647\" })\n",
        "\n",
        "\n",
        "# CREATE (c)<-[:SCO]-(:Class { authoritativeLabel: \"Cyclone\", name: \"Cyclone\", identifier: \"sh 85034488\" })-[:SCO]->(po)\n",
        "# CREATE (c)<-[:SCO]-(:Class { authoritativeLabel: \"Tsunami\", name: \"Tsunami\", identifier: \"sh 85034503\" })-[:SCO]->(s)\n",
        "# CREATE (c)<-[:SCO]-(:Class { authoritativeLabel: \"Tempete\", name: \"Tempete\", identifier: \"sh 2007001101\" })\n",
        "# CREATE (c)<-[:SCO]-(:Class { authoritativeLabel: \"Seisme\", name: \"Seisme\", identifier: \"sh 85068653\" })\n",
        "# CREATE (cata)<-[:SCO]-(c)\n",
        "# \"\"\"\n",
        "\n",
        "# run_query(onto)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "a5b80aa5",
      "metadata": {},
      "outputs": [],
      "source": [
        "# data = \"\"\"\n",
        "# CREATE (:Event:Cyclone { title: \"Cyclone\", identifier: \"2167673\"})\n",
        "# CREATE (:Event:Tempete { title: \"Tempete\", identifier: \"11916857\"})\n",
        "\n",
        "# CREATE (:Event:Seisme { title: \"Seisme 1\", identifier: \"8096161\"})\n",
        "\n",
        "# CREATE (:Event:Seisme { title: \"Seisme 2\", identifier: \"12873809\"})\n",
        "# CREATE (:Event:Tsunami { title: \"Tsunami\", identifier: \"20234576\"})\n",
        "# \"\"\"\n",
        "\n",
        "# run_query(data)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "93db749d",
      "metadata": {},
      "outputs": [],
      "source": [
        "# infer = \"\"\"CALL n10s.inference.nodesLabelled('CatastropheNaturelle',  {\n",
        "#   catNameProp: \"name\",\n",
        "#   catLabel: \"Class\",\n",
        "#   subCatRel: \"SCO\"\n",
        "# })\n",
        "# YIELD node\n",
        "# RETURN labels(node), node.name, node.description\n",
        "# \"\"\"\n",
        "\n",
        "# run_query(infer)"
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 21,
      "id": "5da1015b",
      "metadata": {},
      "outputs": [
        {
          "name": "stdout",
          "output_type": "stream",
          "text": [
            "[]\n"
          ]
        }
      ],
      "source": [
        "from SPARQLWrapper import SPARQLWrapper, JSON\n",
        "\n",
        "# Endpoint Wikidata\n",
        "endpoint_url = \"https://query.wikidata.org/sparql\"\n",
        "\n",
        "# Requête pour récupérer les sous-classes de chaque classe\n",
        "query_template = \"\"\"\n",
        "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
        "SELECT ?subclass ?label WHERE {{\n",
        "  ?subclass rdfs:subClassOf wd:{class_id}.\n",
        "  ?subclass rdfs:label ?label .\n",
        "  FILTER(LANG(?label) = \"fr\")\n",
        "}} \n",
        "\"\"\"\n",
        "\n",
        "# Fonction pour exécuter la requête pour chaque classe\n",
        "def get_subclasses(class_id):\n",
        "    sparql = SPARQLWrapper(endpoint_url)\n",
        "    query = query_template.format(class_id=class_id)\n",
        "    sparql.setQuery(query)\n",
        "    sparql.setReturnFormat(JSON)\n",
        "    results = sparql.query().convert()\n",
        "    subclasses = [(result[\"subclass\"][\"value\"], result[\"label\"][\"value\"]) for result in results[\"results\"][\"bindings\"]]\n",
        "    return subclasses\n",
        "\n",
        "# Exemple d'utilisation\n",
        "class_id = \"Q3839081\"  # Id de la classe \"catastrophe\" dans Wikidata\n",
        "subclasses = get_subclasses(class_id)\n",
        "print(subclasses)\n"
      ]
    }
  ],
  "metadata": {
    "colab": {
      "provenance": []
    },
    "kernelspec": {
      "display_name": "Python 3",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.9.16"
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}
